# Задача №13. Решение в группах
# Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю историю
# наблюдений за погодой. Они обратились к синоптикам, а те, в
# свою очередь, занялись исследованиями статистики за
# прошлые годы. Их интересует, сколько дней длилась самая
# длинная оттепель. Оттепелью они называют период, в
# который среднесуточная температура ежедневно превышала
# 0 градусов Цельсия. Напишите программу, помогающую
# синоптикам в работе.
# Пользователь вводит число N – общее количество
# рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках
# располагается N целых чисел.
# Каждое число – среднесуточная температура в
# соответствующий день. Температуры – целые числа и лежат в
# диапазоне от –50 до 50
# Input: 6 -> -20 30 -40 50 10 -10
# Output: 2a

class ThawDurationCalculator:
    def __init__(self, temperatures):
        self.temperatures = temperatures

    def calculate_longest_period(self):
        longest_period = 0
        current_period = 0
        for temperature in self.temperatures:
            if temperature > 0:
                current_period += 1
                longest_period = max(longest_period, current_period)
            else:
                current_period = 0
        return longest_period


calculator = ThawDurationCalculator([-20, 30, -40, 50, 10, -10])
print(calculator.calculate_longest_period())